----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [30, 32, 512, 512]             320
       BatchNorm2d-2         [30, 32, 512, 512]              64
              ReLU-3         [30, 32, 512, 512]               0
            Conv2d-4         [30, 32, 512, 512]           9,248
       BatchNorm2d-5         [30, 32, 512, 512]              64
              ReLU-6         [30, 32, 512, 512]               0
           First2D-7         [30, 32, 512, 512]               0
         MaxPool2d-8         [30, 32, 256, 256]               0
            Conv2d-9         [30, 64, 256, 256]          18,496
      BatchNorm2d-10         [30, 64, 256, 256]             128
             ReLU-11         [30, 64, 256, 256]               0
           Conv2d-12         [30, 64, 256, 256]          36,928
      BatchNorm2d-13         [30, 64, 256, 256]             128
             ReLU-14         [30, 64, 256, 256]               0
        Encoder2D-15         [30, 64, 256, 256]               0
        MaxPool2d-16         [30, 64, 128, 128]               0
           Conv2d-17        [30, 128, 128, 128]          73,856
      BatchNorm2d-18        [30, 128, 128, 128]             256
             ReLU-19        [30, 128, 128, 128]               0
           Conv2d-20        [30, 128, 128, 128]         147,584
      BatchNorm2d-21        [30, 128, 128, 128]             256
             ReLU-22        [30, 128, 128, 128]               0
        Encoder2D-23        [30, 128, 128, 128]               0
        MaxPool2d-24          [30, 128, 64, 64]               0
           Conv2d-25          [30, 256, 64, 64]         295,168
      BatchNorm2d-26          [30, 256, 64, 64]             512
             ReLU-27          [30, 256, 64, 64]               0
           Conv2d-28          [30, 256, 64, 64]         590,080
      BatchNorm2d-29          [30, 256, 64, 64]             512
             ReLU-30          [30, 256, 64, 64]               0
        Encoder2D-31          [30, 256, 64, 64]               0
        MaxPool2d-32          [30, 256, 32, 32]               0
           Conv2d-33          [30, 512, 32, 32]       1,180,160
      BatchNorm2d-34          [30, 512, 32, 32]           1,024
             ReLU-35          [30, 512, 32, 32]               0
           Conv2d-36          [30, 512, 32, 32]       2,359,808
      BatchNorm2d-37          [30, 512, 32, 32]           1,024
             ReLU-38          [30, 512, 32, 32]               0
  ConvTranspose2d-39          [30, 256, 64, 64]         524,544
         Center2D-40          [30, 256, 64, 64]               0
           Conv2d-41          [30, 256, 64, 64]       1,179,904
      BatchNorm2d-42          [30, 256, 64, 64]             512
             ReLU-43          [30, 256, 64, 64]               0
           Conv2d-44          [30, 256, 64, 64]         590,080
      BatchNorm2d-45          [30, 256, 64, 64]             512
             ReLU-46          [30, 256, 64, 64]               0
  ConvTranspose2d-47        [30, 128, 128, 128]         131,200
        Decoder2D-48        [30, 128, 128, 128]               0
           Conv2d-49        [30, 128, 128, 128]         295,040
      BatchNorm2d-50        [30, 128, 128, 128]             256
             ReLU-51        [30, 128, 128, 128]               0
           Conv2d-52        [30, 128, 128, 128]         147,584
      BatchNorm2d-53        [30, 128, 128, 128]             256
             ReLU-54        [30, 128, 128, 128]               0
  ConvTranspose2d-55         [30, 64, 256, 256]          32,832
        Decoder2D-56         [30, 64, 256, 256]               0
           Conv2d-57         [30, 64, 256, 256]          73,792
      BatchNorm2d-58         [30, 64, 256, 256]             128
             ReLU-59         [30, 64, 256, 256]               0
           Conv2d-60         [30, 64, 256, 256]          36,928
      BatchNorm2d-61         [30, 64, 256, 256]             128
             ReLU-62         [30, 64, 256, 256]               0
  ConvTranspose2d-63         [30, 32, 512, 512]           8,224
        Decoder2D-64         [30, 32, 512, 512]               0
           Conv2d-65         [30, 32, 512, 512]          18,464
      BatchNorm2d-66         [30, 32, 512, 512]              64
             ReLU-67         [30, 32, 512, 512]               0
           Conv2d-68         [30, 32, 512, 512]           9,248
      BatchNorm2d-69         [30, 32, 512, 512]              64
             ReLU-70         [30, 32, 512, 512]               0
           Conv2d-71          [30, 4, 512, 512]             132
          Softmax-72          [30, 4, 512, 512]               0
           Last2D-73          [30, 4, 512, 512]               0
           UNet2D-74          [30, 4, 512, 512]               0
================================================================
Total params: 7,765,508
Trainable params: 7,765,508
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 30.00
Forward/backward pass size (MB): 56580.00
Params size (MB): 29.62
Estimated Total Size (MB): 56639.62
----------------------------------------------------------------

